{
	"name": "Superman",
	"id": "spm-superman",
	"age": 35,
	"imgUrl": [
		"images/superman-main.jpg",
		"images/superman-02.jpg",
		"images/superman-03.jpg",
		"images/superman-04.jpg"
	],
	"description": "The powers of DC Comics character Superman have changed since his introduction in the 1930s. Many other DC Comics characters have Superman's abilities from Kryptonian DNA, such as Zod, Kara Zor-El, and even the hybrid Superboy.",
	"history": [
		"Superman is a fictional superhero appearing in American comic books published by DC Comics, as well as its associated media. Superman is widely considered an American cultural icon.[1][2][3][4] The Superman character was created by writer Jerry Siegel and artist Joe Shuster in 1933, and the character was sold to Detective Comics, Inc. (later DC Comics) in 1938.[5][6] Superman first appeared in Action Comics #1 (June 1938) and subsequently appeared in various radio serials, newspaper strips, television programs, films, and video games. With the success of his adventures, Superman helped to create the superhero genre and establish its primacy within the American comic book.[1] Superman's appearance is distinctive and iconic. He usually wears a blue costume, red cape, and stylized red-and-yellow \"S\" shield on his chest.[7][8][9] This shield is used in a myriad of media to symbolize the character.[10]",
		"The origin story of Superman relates that he was born Kal-El on the planet Krypton, before being rocketed to Earth as an infant by his scientist father Jor-El, moments before Krypton's destruction. Discovered and adopted by a Kansas farmer and his wife, the child is raised as Clark Kent and imbued with a strong moral compass. Very early on he started to display superhuman abilities, which, upon reaching maturity, he resolved to use for the benefit of humanity. Superman resides and operates in the fictional American city of Metropolis. As Clark Kent, he is a journalist for the Daily Planet, a Metropolis newspaper. Superman's primary love interest is Lois Lane and his archenemy is supervillain Lex Luthor.[11]",
		"Superman has fascinated scholars, with cultural theorists, commentators, and critics alike exploring the character's impact and role in the United States and worldwide. The character's ownership has often been the subject of dispute, with Siegel and Shuster twice suing for the return of legal ownership. Superman has been labeled as the greatest comic book hero of all time by IGN, as the editors pointed out that Superman was the blueprint for superheroes as we know them today.[12] Several alternative versions of Superman have also been produced."
	],
	"skills": [
	 	"As an influential archetype of the superhero genre, Superman possesses extraordinary powers, with the character traditionally described as \"Faster than a speeding bullet. More powerful than a locomotive. Able to leap tall buildings in a single bound...It's Superman!\",[112] a phrase coined by Jay Morton and first used in the Superman radio serials and Max Fleischer animated shorts of the 1940s[113] as well as the TV series of the 1950s. For most of his existence, Superman's famous arsenal of powers has included flight, super-strength, invulnerability to non-magical attacks, super-speed, vision powers (including x-ray, heat-emitting, telescopic, infra-red, and microscopic vision), super-hearing, super-intelligence, and super-breath, which enables him to blow out air at freezing temperatures, as well as exert the propulsive force of high-speed winds.[114]",
		"As originally conceived and presented in his early stories, Superman's powers were relatively limited, consisting of superhuman strength that allowed him to lift a car over his head, run at amazing speeds and leap one-eighth of a mile, as well as an incredibly dense body structure that could be pierced by nothing less than an exploding artillery shell.[114] Siegel and Shuster compared his strength and leaping abilities to an ant and a grasshopper.[115] When making the Superman cartoons in the early 1940s, the Fleischer Brothers found it difficult to keep animating him leaping and requested to DC to change his ability to flying; this was an especially convenient concept for short films, which would have otherwise had to waste precious running time moving earthbound Clark Kent from place to place.[116] Writers gradually increased his powers to larger extents during the Silver Age, in which Superman could fly to other worlds and galaxies and even across universes with relative ease.[114] He would often fly across the solar system to stop meteors from hitting the Earth or sometimes just to clear his head. Writers found it increasingly difficult to write Superman stories in which the character was believably challenged,[117] so DC made a series of attempts to rein the character in. The most significant attempt, John Byrne's 1986 rewrite, established several hard limits on his abilities: He barely survives a nuclear blast, and his space flights are limited by how long he can hold his breath.[118] Superman's power levels have again increased since then, with Superman currently possessing enough strength to hurl mountains, withstand nuclear blasts with ease, fly into the sun unharmed, and survive in the vacuum of outer space without oxygen.",
		"The source of Superman's powers has changed subtly over the course of his history. It was originally stated that Superman's abilities derived from his Kryptonian heritage, which made him eons more evolved than humans.[82] This was soon amended, with the source for the powers now based upon the establishment of Krypton's gravity as having been stronger than that of the Earth. This situation mirrors that of Edgar Rice Burroughs' John Carter. As Superman's powers increased, the implication that all Kryptonians had possessed the same abilities became problematic for writers, making it doubtful that a race of such beings could have been wiped out by something as trifling as an exploding planet. In part to counter this, the Superman writers established that Kryptonians, whose native star Rao had been red, possessed superpowers only under the light of a yellow sun.[119]",
		"Superman is most vulnerable to green Kryptonite, mineral debris from Krypton transformed into radioactive material by the forces that destroyed the planet. Exposure to green Kryptonite radiation nullifies Superman's powers and immobilizes him with pain and nausea; prolonged exposure will eventually kill him. The only substance on Earth that can protect him from Kryptonite is lead, which blocks the radiation. Lead is also the only known substance that Superman cannot see through with his x-ray vision. Kryptonite was first introduced to the public in 1943 as a plot device to allow the radio serial voice actor, Bud Collyer, to take some time off.[80] Although green Kryptonite is the most commonly seen form, writers have introduced other forms over the years: such as red, gold, blue, white, and black, each with its own effect.[120]"
	]
}