{
	"name": "Flash",
	"id": "spm-Flash",
	"age": 27,
	"imgUrl": [
		"images/flash-main.jpg",
		"images/flash-02.jpg",
		"images/flash-03.jpg",
		"images/flash-04.jpg"
	],
	"description": "The Flash is a fictional superhero who appears in American comic books published by DC Comics. Created by writer Gardner Fox and artist Harry Lampert, the original Flash first appeared in Flash Comics #1 (January 1940)",
	"history": [
		"The Flash is a fictional superhero who appears in American comic books published by DC Comics. Created by writer Gardner Fox and artist Harry Lampert, the original Flash first appeared in Flash Comics #1 (January 1940)",
		"Nicknamed the Scarlet Speedster, the \"Crimson Comet\" and \"The Blur\", all incarnations of the Flash possess \"super speed\", which includes the ability to run and move extremely fast, use superhuman reflexes, and seemingly violate certain laws of physics. Thus far, four different characters—each of whom somehow gained the power of \"super-speed\"—have assumed the identity of the Flash: Jay Garrick (1940–present), Barry Allen (1956–1985, 2008–present), Wally West (1986–2006, 2007–2012, 2013–present), and Bart Allen (2006–2007). Before Wally and Bart's ascension to the mantle of the Flash, they were both Flash protégés under the same name Kid Flash (Bart was also known as Impulse).",
		"The second incarnation of the Flash, Flash (Barry Allen), is generally considered the first hero of the Silver Age of comic books and the version of the hero most often featured in live action shows. On May 6, 2011, IGN ranked the third flash, Wally West, #8 on their list of the \"Top 100 Super Heroes of All Time\", stating that \"Wally West is one of the DC’s greatest heroes, even if he doesn’t rank as the original \"Scarlet Speedster\".[2] Each version of the Flash has been a key member of at least one of DC's premier teams: the Justice Society of America, the Justice League, and the Teen Titans.",
		"The Barry Allen version of the character (with Wally West elements) was featured in a live action television series, simply titled The Flash, in 1990, starring John Wesley Shipp. The Wally West version of the Flash (but with many elements of Barry Allen's story) is featured in the animated series Justice League. All four incarnations of the character have appeared in the Young Justice animated series, with the Wally West version of Kid Flash as a main character in the first season.",
		"A new television series, also simply titled The Flash, starring Grant Gustin in the title role premiered on the CW on October 7, 2014. This new program features a younger Barry Allen with numerous elements of the earlier show as well as using many characters from the larger DC Universe.[3]"
	],
	"skills": [
		"All incarnations of the Flash can move, think, and react at light speeds as well as having superhuman endurance that allows them to run incredible distances. He has run fast enough to encounter God but the comic was discarded for religious reasons. Some, notably later versions, can vibrate so fast that they can pass through walls in a process called quantum tunneling. ,[16] travel through time and can also lend and borrow speed. Furthermore, all members have an invisible aura around their bodies that prevents themselves and their clothes from being affected by air friction as they move at high speed.[volume & issue needed] Speedsters can heal more rapidly than the average human.",
		"On several occasions, the Flash has raced against Superman, either to determine who is faster or as part of a mutual effort to thwart some type of threat; these races, however, often resulted in ties because of outside circumstances. Writer Jim Shooter and artist Curt Swan crafted the story \"Superman's Race With the Flash!\" in Superman #199 (Aug. 1967) which featured the first race between the Flash and Superman.[17] Writer E. Nelson Bridwell and artist Ross Andru produced \"The Race to the End of the Universe\", a follow-up story four months later in The Flash #175 (Dec. 1967).[18] However, after the DC Universe revision after Crisis on Infinite Earths, The Flash does successfully beat Superman in a race in Adventures of Superman #463 with the explanation that Superman is not accustomed to running at high speed for extended periods of time since flying is more versatile and less strenuous, which means the far more practiced Flash has the advantage. After Final Crisis in Flash: Rebirth #3 the Flash is shown as being much faster than Superman, able to outstripping him as Superman struggles to keep up with him. He reveals that all the close races between them had been \"for charity\".",
		"Speedsters may at times use the ability to speed-read at incredible rates and in doing so, process vast amounts of information. Whatever knowledge they acquire in this manner is usually temporary (Bart Allen seems to be the exception, though in earlier years, Max Mercury believed that Bart's speed learning would not stick).[volume & issue needed] Their ability to think fast also allows them some immunity to telepathy, as their thoughts operate at a rate too rapid for telepaths such as Martian Manhunter or Gorilla Grodd to read or influence their minds.",
		"Flashes and other super-speedsters also have the ability to speak to one another at a highly accelerated rate. This is often done to have private conversations in front of non-fast people (as when Flash speaks to Superman about his ability to serve both the Titans and the JLA in The Titans #2). Speed-talking is also sometimes used for comedic effect where Flash becomes so excited that he begins talking faster and faster until his words become a jumble of noise.",
		"The Flash has also claimed that he can process thoughts in less than an attosecond."
	]
}